In [1]:
# in this module we will be learning about the data frames 

import pandas as pd

In [7]:
# Creating the data frame with the help of dict

data={"subject":["maths","science","SST","English","Kannada"],
      "marks":(85,55,65,90,82),
      "cgpa":[8.2,9.3,7.5,9.91,8.4]}
pd.DataFrame(data).T

             0        1    2        3        4
subject  maths  science  SST  English  Kannada
marks       85       55   65       90       82
cgpa       8.2      9.3  7.5     9.91      8.4

In [13]:
#Creating a dataframe of list of students with their branch, cgpa and name with the help of list 

names=["Karthik","Abhi","Shreya","Shravya","Shraddha"]
branch=["Data Science","MCA","CS","MBBS","MBBS"]
cgpa=[8.84,9,7.75,9.0,9.1]

pd.DataFrame([names,branch,cgpa])

              0     1       2        3         4
0       Karthik  Abhi  Shreya  Shravya  Shraddha
1  Data Science   MCA      CS     MBBS      MBBS
2          8.84     9    7.75      9.0       9.1

In [21]:
pd.DataFrame([names,branch,cgpa],index=["names","branch","cgpa"]).T

      names        branch  cgpa
0   Karthik  Data Science  8.84
1      Abhi           MCA     9
2    Shreya            CS  7.75
3   Shravya          MBBS   9.0
4  Shraddha          MBBS   9.1

In [19]:
a1 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']

a2 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']

a3 = ['Hogwarts', 'Durmstrang', 'Beauxbatons']

school = [a1, a2, a3]

inst = ['School_1', 'School_2', 'School_3']

Muggle_data = pd.DataFrame(data=school, columns=inst)

print(Mugg)

   School_1    School_2     School_3
0  Hogwarts  Durmstrang  Beauxbatons
1  Hogwarts  Durmstrang  Beauxbatons
2  Hogwarts  Durmstrang  Beauxbatons

In [23]:
#How to extract data from a csv file 


data=pd.read_csv("survey_results_schema.csv")

In [27]:
data.head(1000)

,qid,qname,question,force_resp,type,selector
0,QID16,S0,"<div><span style=""font-size:19px;""><strong>Hel...",False,DB,TB
1,QID12,MetaInfo,Browser Meta Info,False,Meta,Browser
2,QID1,S1,"<span style=""font-size:22px; font-family: aria...",False,DB,TB
3,QID2,MainBranch,Which of the following options best describes ...,True,MC,SAVR
4,QID296,Employment,Which of the following best describes your cur...,False,MC,MAVR
...,...,...,...,...,...,...
74,QID290,Frequency_2,Interacting with people outside of your immedi...,NaN,MC,MAVR
75,QID290,Frequency_3,Encountering knowledge silos (where one indivi...,NaN,MC,MAVR
76,QID294,TrueFalse_1,Are you involved in supporting new hires durin...,NaN,MC,MAVR
77,QID294,TrueFalse_2,Do you use learning resources provided by your...,NaN,MC,MAVR
78,QID294,TrueFalse_3,Does your employer give you time to learn new ...,NaN,MC,MAVR

In [29]:
type(data["qid"])

pandas.core.series.Series

In [30]:
# To find out how many rows and columns there in the extracted data 

data.shape

(79, 6)

In [32]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79 entries, 0 to 78
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   qid         79 non-null     object
 1   qname       79 non-null     object
 2   question    79 non-null     object
 3   force_resp  66 non-null     object
 4   type        79 non-null     object
 5   selector    79 non-null     object
dtypes: object(6)
memory usage: 3.8+ KB

In [33]:
data["qid"]

0      QID16
1      QID12
2       QID1
3       QID2
4     QID296
       ...
74    QID290
75    QID290
76    QID294
77    QID294
78    QID294
Name: qid, Length: 79, dtype: object

In [39]:
data1=pd.read_csv("C:\\Users\\abhis\\Downloads\\stack-overflow-developer-survey-2022\\survey_results_public.csv")

In [40]:
data1.shape

(73268, 79)

In [41]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73268 entries, 0 to 73267
Data columns (total 79 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   ResponseId                      73268 non-null  int64
 1   MainBranch                      73268 non-null  object
 2   Employment                      71709 non-null  object
 3   RemoteWork                      58958 non-null  object
 4   CodingActivities                58899 non-null  object
 5   EdLevel                         71571 non-null  object
 6   LearnCode                       71580 non-null  object
 7   LearnCodeOnline                 50685 non-null  object
 8   LearnCodeCoursesCert            29389 non-null  object
 9   YearsCode                       71331 non-null  object
 10  YearsCodePro                    51833 non-null  object
 11  DevType                         61302 non-null  object
 12  OrgSize                         51039 non-null  object
 13  PurchaseInfluence               50969 non-null  object
 14  BuyNewTool                      67963 non-null  object
 15  Country                         71771 non-null  object
 16  Currency                        51264 non-null  object
 17  CompTotal                       38422 non-null  float64
 18  CompFreq                        44425 non-null  object
 19  LanguageHaveWorkedWith          70975 non-null  object
 20  LanguageWantToWorkWith          67027 non-null  object
 21  DatabaseHaveWorkedWith          60121 non-null  object
 22  DatabaseWantToWorkWith          51014 non-null  object
 23  PlatformHaveWorkedWith          49924 non-null  object
 24  PlatformWantToWorkWith          40415 non-null  object
 25  WebframeHaveWorkedWith          53544 non-null  object
 26  WebframeWantToWorkWith          46122 non-null  object
 27  MiscTechHaveWorkedWith          44992 non-null  object
 28  MiscTechWantToWorkWith          36810 non-null  object
 29  ToolsTechHaveWorkedWith         54171 non-null  object
 30  ToolsTechWantToWorkWith         46566 non-null  object
 31  NEWCollabToolsHaveWorkedWith    70347 non-null  object
 32  NEWCollabToolsWantToWorkWith    64108 non-null  object
 33  OpSysProfessional use           65503 non-null  object
 34  OpSysPersonal use               70963 non-null  object
 35  VersionControlSystem            71379 non-null  object
 36  VCInteraction                   68156 non-null  object
 37  VCHostingPersonal use           0 non-null      float64
 38  VCHostingProfessional use       0 non-null      float64
 39  OfficeStackAsyncHaveWorkedWith  46223 non-null  object
 40  OfficeStackAsyncWantToWorkWith  32072 non-null  object
 41  OfficeStackSyncHaveWorkedWith   62128 non-null  object
 42  OfficeStackSyncWantToWorkWith   47688 non-null  object
 43  Blockchain                      71071 non-null  object
 44  NEWSOSites                      71365 non-null  object
 45  SOVisitFreq                     70961 non-null  object
 46  SOAccount                       71572 non-null  object
 47  SOPartFreq                      58229 non-null  object
 48  SOComm                          71408 non-null  object
 49  Age                             70946 non-null  object
 50  Gender                          70853 non-null  object
 51  Trans                           70315 non-null  object
 52  Sexuality                       66565 non-null  object
 53  Ethnicity                       69474 non-null  object
 54  Accessibility                   67244 non-null  object
 55  MentalHealth                    66447 non-null  object
 56  TBranch                         52670 non-null  object
 57  ICorPM                          36283 non-null  object
 58  WorkExp                         36769 non-null  float64
 59  Knowledge_1                     35804 non-null  object
 60  Knowledge_2                     34973 non-null  object
 61  Knowledge_3                     35133 non-null  object
 62  Knowledge_4                     35097 non-null  object
 63  Knowledge_5                     35014 non-null  object
 64  Knowledge_6                     34991 non-null  object
 65  Knowledge_7                     34977 non-null  object
 66  Frequency_1                     35371 non-null  object
 67  Frequency_2                     35344 non-null  object
 68  Frequency_3                     34515 non-null  object
 69  TimeSearching                   36198 non-null  object
 70  TimeAnswering                   36022 non-null  object
 71  Onboarding                      35679 non-null  object
 72  ProfessionalTech                34906 non-null  object
 73  TrueFalse_1                     35819 non-null  object
 74  TrueFalse_2                     35715 non-null  object
 75  TrueFalse_3                     35749 non-null  object
 76  SurveyLength                    70444 non-null  object
 77  SurveyEase                      70508 non-null  object
 78  ConvertedCompYearly             38071 non-null  float64
dtypes: float64(5), int64(1), object(73)
memory usage: 44.2+ MB

In [42]:
data1.head()

,ResponseId,MainBranch,Employment,RemoteWork,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,LearnCodeCoursesCert,YearsCode,...,TimeSearching,TimeAnswering,Onboarding,ProfessionalTech,TrueFalse_1,TrueFalse_2,TrueFalse_3,SurveyLength,SurveyEase,ConvertedCompYearly
0,1,None of these,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,I am a developer by profession,"Employed, full-time",Fully remote,Hobby;Contribute to open-source projects,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Difficult,NaN
2,3,"I am not primarily a developer, but I write co...","Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Master’s degree (M.A., M.S., M.Eng., MBA, etc.)",Books / Physical media;Friend or family member...,Technical documentation;Blogs;Programming Game...,NaN,14,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Neither easy nor difficult,40205.0
3,4,I am a developer by profession,"Employed, full-time",Fully remote,I don’t code outside of work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Books / Physical media;School (i.e., Universit...",NaN,NaN,20,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Appropriate in length,Easy,215232.0
4,5,I am a developer by profession,"Employed, full-time","Hybrid (some remote, some in-person)",Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Blogs;Stack Overflow;O...,NaN,8,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Too long,Easy,NaN

In [47]:
data3=pd.read_csv("C:\\Users\\abhis\\Desktop\\weight-height.csv")
print(data3)

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [49]:
data3["BMI"]=data3["Weight"]/data3["Height"]**2

In [50]:
print(data3)

      Gender     Height      Weight       BMI
0       Male  73.847017  241.893563  0.044357
1       Male  68.781904  162.310473  0.034308
2       Male  74.110105  212.740856  0.038734
3       Male  71.730978  220.042470  0.042765
4       Male  69.881796  206.349801  0.042255
...      ...        ...         ...       ...
9995  Female  66.172652  136.777454  0.031236
9996  Female  67.067155  170.867906  0.037988
9997  Female  63.867992  128.475319  0.031496
9998  Female  69.034243  163.852461  0.034381
9999  Female  61.944246  113.649103  0.029619

[10000 rows x 4 columns]

In [51]:
data3.head()

  Gender     Height      Weight       BMI
0   Male  73.847017  241.893563  0.044357
1   Male  68.781904  162.310473  0.034308
2   Male  74.110105  212.740856  0.038734
3   Male  71.730978  220.042470  0.042765
4   Male  69.881796  206.349801  0.042255

In [52]:
data3.shape

(10000, 4)

In [53]:
#2. To add a new row into the dataframe

data3.loc[10001]=["female",70.1,210,0.04]

In [54]:
data3.shape

(10001, 4)

In [55]:
data_copy=data3.copy()

In [58]:
data_copy.loc[10002]=["female",70.2,220,0.05]

In [59]:
data_copy.shape

(10002, 4)

In [60]:
data_copy.tail(5)

       Gender     Height      Weight       BMI
9997   Female  63.867992  128.475319  0.031496
9998   Female  69.034243  163.852461  0.034381
9999   Female  61.944246  113.649103  0.029619
10001  female  70.100000  210.000000  0.040000
10002  female  70.200000  220.000000  0.050000

In [61]:
data_copy.iloc[9999]

Gender        Female
Height     61.944246
Weight    113.649103
BMI         0.029619
Name: 9999, dtype: object

In [62]:
data_copy.iloc[0:5]

  Gender     Height      Weight       BMI
0   Male  73.847017  241.893563  0.044357
1   Male  68.781904  162.310473  0.034308
2   Male  74.110105  212.740856  0.038734
3   Male  71.730978  220.042470  0.042765
4   Male  69.881796  206.349801  0.042255

In [64]:
data_copy.iloc[0:,0]

0          Male
1          Male
2          Male
3          Male
4          Male
          ...
9997     Female
9998     Female
9999     Female
10001    female
10002    female
Name: Gender, Length: 10002, dtype: object

In [65]:
data_copy.iloc[[4,5,888]]

    Gender     Height      Weight       BMI
4     Male  69.881796  206.349801  0.042255
5     Male  67.253016  152.212156  0.033653
888   Male  67.787694  190.506796  0.041458

In [66]:
data_copy["Gender"]

0          Male
1          Male
2          Male
3          Male
4          Male
          ...
9997     Female
9998     Female
9999     Female
10001    female
10002    female
Name: Gender, Length: 10002, dtype: object